app/views/tags_recipes/_form.html.erb

SELECT "tags".* FROM "tags" WHERE "tags"."approved" = $1  [["approved", 1]]
---
    <%= f.label :tag_id %>
    <%= f.collection_select :tag_id, Tag.where( :approved => 1 ) , :id, :tag_name %>

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
---
    <%= f.label :recipe_id %>
    	<%= f.collection_select :recipe_id, Recipe.where( :user_id => current_user.id ), :id, :recipe_name %>