app/views/recipes/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
              <% if User.exists?(recipe.user_id) %>
                <td><%= User.find(recipe.user_id).user_name %></td>