app/controllers/recipes_controller.rb

  def index
    #finding recipes by clicking tags
    if params[:tag]
      @tagged_id = TagsRecipe.where(tag_id: params[:tag])
      i = 0
      recipeid = []
      until i == @tagged_id.size
---
SELECT "tags_recipes".* FROM "tags_recipes" WHERE "tags_recipes"."recipe_id" = $1  [["recipe_id", 1]]

  def show
    impressionist(@recipe)
    @tags_recipes = TagsRecipe.all
---
SELECT "tags_recipes".* FROM "tags_recipes" WHERE "tags_recipes"."recipe_id" = $1  [["recipe_id", 1]]

  def new
    @recipe = Recipe.new
    @tags_recipe = TagsRecipe.new
    @tag = Tag.all
---
SELECT "tags".* FROM "tags"

  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if current_user.recipes << @recipe
---
INSERT INTO "recipes" ("recipe_id", "user_id", "recipe_name", "instructions", "complexity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "complexity" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["complexity", 91], ["updated_at", 2016-11-06 13:47:48 UTC], ["id", 2]]