app/controllers/recipe_images_controller.rb

  def new
    @recipe_image = RecipeImage.new(:image_name => '')
    @recipe_id = params[:recipe_id]

    if current_user != Recipe.find(@recipe_id).user
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @recipe_image = RecipeImage.new(recipe_image_params)
    @recipe_id = params[:recipe_id]
    @recipe = Recipe.find(@recipe_id)
    if @recipe.recipe_images << @recipe_image
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "recipe_images" ("recipe_id", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["recipe_id", 1], ["image", "pizza.jpg"], ["created_at", 2016-11-10 23:59:57 UTC], ["updated_at", 2016-11-10 23:59:57 UTC]]