app/controllers/sessions_controller.rb

  def attempt_login
    @username_param = params[:username]
    @password_param = params[:password]

    if User.exists?(user_name: @username_param)
      @user = User.where(user_name: @username_param).first
      @password_param = BCrypt::Engine.hash_secret(@password_param, @user.salt)
    end

    if User.exists?(user_name: @username_param, encrypted_password: @password_param)
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 AND "users"."password" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["user_name", "Extreme112"], ["password", "askdh"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."user_name" = $1 AND "users"."password" = $2 LIMIT $3  [["user_name", "Extreme112"], ["password", "askdh"], ["LIMIT", 1]]