app/controllers/tags_recipes_controller.rb

SELECT "tags_recipes".* FROM "tags_recipes"
---
  def index
    @tags_recipes = TagsRecipe.all

INSERT INTO "tags_recipes" ("tag_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_id", 3], ["recipe_id", 1], ["created_at", 2016-11-06 15:53:47 UTC], ["updated_at", 2016-11-06 15:53:47 UTC]]
---
  def create
    @tags_recipe = TagsRecipe.new(tags_recipe_params)

    respond_to do |format|
      if @tags_recipe.save

DELETE FROM "tags_recipes" WHERE "tags_recipes"."id" = $1  [["id", 3]]
---
  def destroy
    @tags_recipe.destroy

SELECT  "tags_recipes".* FROM "tags_recipes" WHERE "tags_recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_tags_recipe
      @tags_recipe = TagsRecipe.find(params[:id])