app/controllers/tags_controller.rb

INSERT INTO "tags" ("tag_name", "approved", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tag_name", "test"], ["approved", true], ["created_at", 2016-11-06 14:36:50 UTC], ["updated_at", 2016-11-06 14:36:50 UTC]]
---
  def create
    @tag = Tag.new(tag_params)

    respond_to do |format|
      if @tag.save

UPDATE "tags" SET "tag_name" = $1, "updated_at" = $2 WHERE "tags"."id" = $3  [["tag_name", "vegan"], ["updated_at", 2016-11-06 14:36:57 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @tag.update(tag_params)

DELETE FROM "tags" WHERE "tags"."id" = $1  [["id", 4]]
---
  def destroy
    @tag.destroy