app/controllers/users_controller.rb

  def show
    @recipes = @user.recipes
    @recipes = Kaminari.paginate_array(@recipes).page(params[:page]).per(2)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 2], ["LIMIT", 2], ["OFFSET", 2]]
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 2]]

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("user_name", "password", "first_name", "last_name", "email", "privileges", "user_level", "points", "created_at", "updated_at", "uid", "provider") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "bio" = $1, "image" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["bio", ""], ["image", "icon-user-default.png"], ["updated_at", 2016-11-10 19:47:55 UTC], ["id", 2]]